ЦентраАдминистрированияСервер/src/Catalogs/РеестрДоработок/РеестрДоработок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РеестрДоработок</name>
  <owners>Catalog.Конфигурации</owners>
  <attributes>
    <name>ВесДоработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Категория</name>
    <type>
      <types>EnumRef.КатегорияДоработки</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДоработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзмененныеМетаданные</name>
    <attributes>
      <name>Объект</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеИзменений</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ЦентраАдминистрированияСервер/src/Catalogs/РеестрДоработок/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда	
		Объект.Дата = ТекущаяДата();
	КонецЕсли;            
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда	
	Объект.Ответственный = ПараметрыСеанса.ТекущийПользователь.Наименование;
	КонецЕсли;
КонецПроцедуры
